import { useEffect, useRef } from 'react';
import './style.scss';
import { gsap } from 'gsap';
import SearchBar from '../../ui/SearchBar/SearchBar';

const HomeVisual = () => {
    const textRef = useRef(null);

    useEffect(() => {
        const el = textRef.current;
        const q = gsap.utils.selector(el);

        gsap.from(q('h1, p'), {
            opacity: 1,
            y: 50,
            duration: 1,
            stagger: 0.3, // 요소마다 순서대로
            ease: 'power3.out',
        });
    }, []);

    return (
        <div className="mainvisual">
            {/* 배경 */}
            <video autoPlay muted loop playsInline>
                <source src="/videos/main/visual_bg.mp4" type="video/mp4" />
                브라우저가 비디오 태그를 지원하지 않습니다.
            </video>
            {/* 오버레이 */}
            <div className="overlay"></div>
            <div className="text" ref={textRef}>
                <h2>
                    Cinematic Scene
                    <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="59"
                        height="82"
                        viewBox="0 0 59 80"
                        fill="none"
                    >
                        <path
                            d="M21.9898 78.6105V14.1105H1.08984V0.810547H57.4898V14.1105H36.6898V78.6105H21.9898Z"
                            fill="#FFF3EE"
                            fill-opacity="0.1"
                            stroke="#FFF3EE"
                            stroke-width="1.5"
                        />
                    </svg>
                    <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="80"
                        height="82"
                        viewBox="0 0 80 82"
                        fill="none"
                        className="tour-o"
                    >
                        {' '}
                        <path
                            d="M40.0906 80.41C32.7006 80.41 25.9906 78.71 20.1406 75.34C14.2706 71.97 9.63063 67.2 6.33063 61.16C3.05063 55.16 1.39062 48.28 1.39062 40.7C1.39062 33.12 3.05063 26.24 6.33063 20.24C9.63063 14.21 14.2706 9.44 20.1406 6.07C25.9806 2.71 32.7006 1 40.0906 1C47.4806 1 54.2906 2.7 60.1406 6.07C66.0006 9.44 70.6506 14.21 73.9506 20.24C77.2306 26.25 78.9006 33.13 78.9006 40.7C78.9006 48.27 77.2406 55.16 73.9506 61.16C70.6506 67.2 66.0106 71.96 60.1406 75.34C54.2906 78.7 47.5506 80.41 40.0906 80.41ZM40.0906 14.31C35.3506 14.31 31.1206 15.41 27.5206 17.57C23.9306 19.73 21.1106 22.82 19.1206 26.76C17.1106 30.76 16.0806 35.45 16.0806 40.71C16.0806 45.97 17.1006 50.66 19.1206 54.66C21.1006 58.6 23.9306 61.69 27.5106 63.85C31.1106 66.02 35.3406 67.11 40.0806 67.11C44.8206 67.11 49.0706 66.01 52.7106 63.84C56.3306 61.68 59.1706 58.59 61.1506 54.66C63.1606 50.66 64.1906 45.97 64.1906 40.71C64.1906 35.45 63.1706 30.76 61.1506 26.76C59.1706 22.83 56.3306 19.74 52.7106 17.58C49.0706 15.41 44.8306 14.31 40.0806 14.31H40.0906Z"
                            fill="#FFF3EE"
                            fill-opacity="0.1"
                            stroke="#FFF3EE"
                            stroke-width="1.5"
                        />{' '}
                    </svg>{' '}
                    <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="63"
                        height="81"
                        viewBox="0 0 63 81"
                        fill="none"
                        className="tour-u"
                    >
                        <path
                            d="M31.1902 79.3105C25.0502 79.3105 19.6303 77.9405 15.0703 75.2305C10.4903 72.5105 6.95023 68.6805 4.55023 63.8505C2.19023 59.0905 0.990234 53.5606 0.990234 47.4105V0.810547H15.5903V47.4105C15.5903 53.1005 16.9502 57.6205 19.6302 60.8305C22.2202 63.9405 26.1102 65.5106 31.1902 65.5106C36.2702 65.5106 40.1702 63.9405 42.7502 60.8305C45.4302 57.6205 46.7902 53.1005 46.7902 47.4105V0.810547H61.4902V47.4105C61.4902 53.5606 60.2702 59.1005 57.8802 63.8605C55.4502 68.6906 51.9002 72.5105 47.3102 75.2305C42.7502 77.9405 37.3202 79.3105 31.1902 79.3105Z"
                            fill="#FFF3EE"
                            fill-opacity="0.1"
                            stroke="#FFF3EE"
                            stroke-width="1.5"
                        />
                        {''}
                    </svg>{' '}
                    <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="63"
                        height="80"
                        viewBox="0 0 60 80"
                        fill="none"
                        className="tour-r"
                    >
                        {' '}
                        <path
                            d="M43.54 78.6105L24.84 50.9105H15.6V78.6105H1V0.810547H31C35.79 0.810547 40.12 1.87055 43.87 3.96055C47.65 6.07055 50.64 9.08055 52.75 12.8905C54.84 16.6705 55.9 21.0505 55.9 25.9105C55.9 31.1905 54.39 35.9405 51.42 40.0305C48.88 43.5205 45.3001 46.3106 40.7401 48.3405L61.16 78.6105H43.53H43.54ZM29.7 37.6105C33.2 37.6105 36.04 36.5505 38.14 34.4506C40.24 32.3505 41.3 29.4405 41.3 25.8105C41.3 22.1805 40.24 19.3005 38.14 17.2305C36.04 15.1605 33.2 14.1105 29.69 14.1105H15.59V37.6105H29.69H29.7Z"
                            fill="#FFF3EE"
                            fill-opacity="0.1"
                            stroke="#FFF3EE"
                            stroke-width="1.5"
                        />{' '}
                    </svg>
                </h2>
                <p>
                    클릭 한 번으로 즐기는 <span>영화 같은 여행</span>
                </p>
                <div className="search-bar-wrap">
                    <SearchBar />
                </div>
            </div>
        </div>
    );
};

export default HomeVisual;
